app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "hello precious how are you"], ["created_at", "2020-07-14 15:33:59.945377"], ["updated_at", "2020-07-14 15:33:59.945377"], ["user_id", 1]]
---
  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save